#### 2023-04-05

##### 1교시

In [5]:
#1 
import numpy as np
import pandas as pd
df = pd.DataFrame({'A':[0,1,2,3,4,5],'B':[0,2,4,6,8,10]}) 
df

   A   B
0  0   0
1  1   2
2  2   4
3  3   6
4  4   8
5  5  10

In [7]:
#2  2와 4를 결측치로 바꿔주세요.
df[(df==2)|(df==4)] = np.nan
df

     A     B
0  0.0   0.0
1  1.0   NaN
2  NaN   NaN
3  3.0   6.0
4  NaN   8.0
5  5.0  10.0

In [11]:
#3  표준정규분포에서 (4,3) 배열을 만들어서 데이터 프레임으로 바꿔 주세요.
df = pd.DataFrame(np.random.randn(4,3),index=['a','b','c','d'])
df

          0         1         2
a  0.439147  0.617609 -0.499669
b -0.151500  0.872546 -0.375241
c  1.584486 -1.482168 -0.615113
d -0.753541  0.946663  0.764409

In [12]:
#4  정규분포의 음의 값을 양의 값으로 바꿔주세요.
df.apply(abs)

          0         1         2
a  0.439147  0.617609  0.499669
b  0.151500  0.872546  0.375241
c  1.584486  1.482168  0.615113
d  0.753541  0.946663  0.764409

In [17]:
#5  mpg칼럼이 26인 행만 추출해주세요.
mpg = pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/master/auto-mpg.csv')
mpg[mpg['mpg']==26] #방법1
mpg[mpg['mpg'].isin([26])] #방법2

,mpg,cylinders,displacement,horsepower,weight,acceleration,model-year
19,26.0,4,97.0,46.0,1835,20.5,70
23,26.0,4,121.0,113.0,2234,12.5,70
56,26.0,4,91.0,70.0,1955,20.5,71
79,26.0,4,96.0,69.0,2189,18.0,72
102,26.0,4,97.0,46.0,1950,21.0,73
114,26.0,4,98.0,90.0,2265,15.5,73
130,26.0,4,122.0,80.0,2451,16.5,74
142,26.0,4,79.0,67.0,1963,15.5,74
143,26.0,4,97.0,78.0,2300,14.5,74
148,26.0,4,116.0,75.0,2246,14.0,74
150,26.0,4,108.0,93.0,2391,15.5,74
185,26.0,4,98.0,79.0,2255,17.7,76
235,26.0,4,97.0,75.0,2265,18.2,77
388,26.0,4,156.0,92.0,2585,14.5,82

In [46]:
#6
df = pd.DataFrame([[100, 'C100', '컴퓨터구조', 91],
                     [200, 'C200', '데이터베이스', 85],
                     [400, 'C300', '운영체제', 65],
                     [200, 'C300', '운영체제', 85],
                     [300, 'C100', '컴퓨터구조', 100],
                     [500, 'C200', '데이터베이스', 55]],
                     index = range(1,7), columns=['학번','과목번호','과목이름','점수'])
df

    학번  과목번호    과목이름   점수
1  100  C100   컴퓨터구조   91
2  200  C200  데이터베이스   85
3  400  C300    운영체제   65
4  200  C300    운영체제   85
5  300  C100   컴퓨터구조  100
6  500  C200  데이터베이스   55

In [47]:
#7  점수가90이상=A, 80이상=B, 70이하=C 등급칼럼을 추가해주세요.
df['등급'] = np.where(df.점수>=90,'A',np.where(df.점수>=80,'B','C')) #방법1
grade = [] #방법2
for i in df['점수']:
    if i >= 90: grade.append("A")
    elif i >= 80: grade.append("B")
    elif i <= 70: grade.append("C")
df['등급'] = grade 
df

    학번  과목번호    과목이름   점수 등급
1  100  C100   컴퓨터구조   91  A
2  200  C200  데이터베이스   85  B
3  400  C300    운영체제   65  C
4  200  C300    운영체제   85  B
5  300  C100   컴퓨터구조  100  A
6  500  C200  데이터베이스   55  C

In [48]:
#8  학번이 200번인 학생의 총점과 평균을 구해주세요.
df[df['학번']==200]['점수'].sum() #총점
df[df['학번']==200]['점수'].mean() #평균

85.0

In [49]:
#9  A등급은 몇명인지 구하시오.
df[df['등급']=='A'].__len__() #방법1
(df['등급'] == "A").sum() #방법2

2

In [52]:
#10  점수별로 rank를 적용해서 '등수'열을 추가해주세요.
df['등수']=df['점수'].rank(ascending=False, method='first') 
df

    학번  과목번호    과목이름   점수 등급   등수
1  100  C100   컴퓨터구조   91  A  2.0
2  200  C200  데이터베이스   85  B  3.0
3  400  C300    운영체제   65  C  5.0
4  200  C300    운영체제   85  B  4.0
5  300  C100   컴퓨터구조  100  A  1.0
6  500  C200  데이터베이스   55  C  6.0

In [55]:
#11  등수를 자연수로 바꿔주세요.
df['등수'] = df['등수'].map(int)
df

    학번  과목번호    과목이름   점수 등급  등수
1  100  C100   컴퓨터구조   91  A   2
2  200  C200  데이터베이스   85  B   3
3  400  C300    운영체제   65  C   5
4  200  C300    운영체제   85  B   4
5  300  C100   컴퓨터구조  100  A   1
6  500  C200  데이터베이스   55  C   6

In [59]:
df['점수'].describe()

count      6.000000
mean      80.166667
std       16.857244
min       55.000000
25%       70.000000
50%       85.000000
75%       89.500000
max      100.000000
Name: 점수, dtype: float64

In [56]:
#12  90% 점수는 몇점인가요?
df['점수'].quantile(0.9)

95.5

In [62]:
#13  600-c200-데이터베이스-55-c-1 데이터를 마지막 행에 추가해주세요.
df.loc[len(df)] = [600,'C200','데이터베이스',55,'C',1]
df

    학번  과목번호    과목이름   점수 등급  등수
1  100  C100   컴퓨터구조   91  A   2
2  200  C200  데이터베이스   85  B   3
3  400  C300    운영체제   65  C   5
4  200  C300    운영체제   85  B   4
5  300  C100   컴퓨터구조  100  A   1
6  600  C200  데이터베이스   55  C   1

##### 2교시

In [65]:
#271p  누락된 데이터 골라내기
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [74]:
data.dropna()
data.dropna(how = 'all')
data.dropna(axis=1)
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [78]:
data['3'] = np.nan
data.dropna(thresh=1)

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [88]:
#274p  결측치 채우기
data.fillna(0)
data.fillna({1:0.5,2:1})

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  0.5  1.0 NaN
2  NaN  0.5  1.0 NaN
3  NaN  6.5  3.0 NaN

In [86]:
data = data.fillna({1:0.5,2:1})
data.fillna({1:0.5,2:1},inplace=True)
_ = data.fillna({1:0.5,2:1},inplace=True)

In [97]:
data.fillna(method = 'ffill',limit=1)

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  0.5  1.0 NaN
2  1.0  0.5  1.0 NaN
3  NaN  6.5  3.0 NaN

In [98]:
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  0.5  1.0 NaN
2  NaN  0.5  1.0 NaN
3  NaN  6.5  3.0 NaN

In [100]:
#277p  중복 제거하기
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [101]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [104]:
data.drop_duplicates()
data.drop_duplicates(keep='last')
data.drop_duplicates(subset=['k2'])

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

##### 3교시

In [105]:
#279p  함수나 매핑을 이용해서 데이터 변형하기.
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [108]:
data['food']=data['food'].str.lower()
data['food']

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [111]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [114]:
data['animal'] = data['food'].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [116]:
data['food'].map(lambda x: meat_to_animal[x])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [119]:
#281 값 치환하기 replace()
data = pd.Series([1, -999, 2, -999, -1000, 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [131]:
data = data.replace(-999,np.nan) # -999를 NaN으로 변경
data = data.replace([-999,-1000],np.nan) # -1000까지 NaN으로 변경
data = data.replace([-999,-1000],[np.nan,0])
data = data.replace({-999: np.nan, -1000: 0}) 
data

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [141]:
#283p  축 색인 이름 바꾸기
df = pd.DataFrame(np.arange(12).reshape(3,4))
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [142]:
df.index = ['Ohio', 'Colorado', 'New York'] 
df

          0  1   2   3
Ohio      0  1   2   3
Colorado  4  5   6   7
New York  8  9  10  11

In [152]:
df.colums = ['one', 'two', 'three', 'four'] 
df

          0  1   2   3
ohio      0  1   2   3
colorado  4  5   6   7
new york  8  9  10  11

In [153]:
df.index = map( str.lower, df.index)
df

          0  1   2   3
ohio      0  1   2   3
colorado  4  5   6   7
new york  8  9  10  11

In [154]:
df.index.map(lambda x:x.lower())

Index(['ohio', 'colorado', 'new york'], dtype='object')

In [157]:
df.rename(index = str.upper, columns =  str.upper)
df

TypeError: descriptor 'upper' for 'str' objects doesn't apply to a 'int' object

In [159]:
#284p  개별화된 양자화
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32] 
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [160]:
bins = [18,25,35,60,100]

In [162]:
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [163]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [164]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

##### 5교시

In [174]:
#  60부터 120미만까지 2씩 증가하는 5*6 데이터프레임을 만드시오.
df = pd.DataFrame(np.arange(60,120,2).reshape(5,6))
df

     0    1    2    3    4    5
0   60   62   64   66   68   70
1   72   74   76   78   80   82
2   84   86   88   90   92   94
3   96   98  100  102  104  106
4  108  110  112  114  116  118

In [178]:
# 30%에 해당하는 분위수를 출력하는 코드를 작성하시오.
df.loc['30%']=df.quantile(0.3)
df

         0      1      2      3      4      5
0     60.0   62.0   64.0   66.0   68.0   70.0
1     72.0   74.0   76.0   78.0   80.0   82.0
2     84.0   86.0   88.0   90.0   92.0   94.0
3     96.0   98.0  100.0  102.0  104.0  106.0
4    108.0  110.0  112.0  114.0  116.0  118.0
30%   72.6   74.6   76.6   78.6   80.6   82.6

In [179]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [180]:
pd.cut(ages,[18,25,35,60,100],right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [181]:
pd.value_counts(cats)
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [183]:
data = np.random.rand(20)
data

array([0.01668341, 0.02840904, 0.19139155, 0.78300739, 0.94262215,
       0.0235461 , 0.55284119, 0.41443339, 0.44982091, 0.2639588 ,
       0.23451827, 0.62502474, 0.01948371, 0.70011719, 0.06551326,
       0.50169385, 0.05573111, 0.94547925, 0.37013581, 0.8847988 ])

In [184]:
pd.cut(data,4,precision=2)

[(0.016, 0.25], (0.016, 0.25], (0.016, 0.25], (0.71, 0.95], (0.71, 0.95], ..., (0.48, 0.71], (0.016, 0.25], (0.71, 0.95], (0.25, 0.48], (0.71, 0.95]]
Length: 20
Categories (4, interval[float64, right]): [(0.016, 0.25] < (0.25, 0.48] < (0.48, 0.71] < (0.71, 0.95]]

In [190]:
pd.qcut(data,4,precision=2).value_counts()

(0.007000000000000001, 0.063]    5
(0.063, 0.39]                    5
(0.39, 0.64]                     5
(0.64, 0.95]                     5
dtype: int64

In [197]:
#288p  특잇값을 찾고 제외하기
df = pd.DataFrame(np.random.randn(1000,4))
df

            0         1         2         3
0   -0.381863 -0.208782  1.302048 -1.296008
1    0.979399 -0.847776  2.439245  1.676612
2    0.856269 -0.880659  0.589888  0.831434
3    0.521491  2.164635 -0.297999  0.659623
4    0.959211  1.084173 -0.675985 -0.572040
..        ...       ...       ...       ...
995  0.613822 -1.361268 -1.329614  1.722410
996  0.775511  1.365987  0.145327  0.579562
997 -0.943353 -0.536369  0.231741  1.299640
998 -0.574126  0.718110 -0.884863  2.530063
999  0.123482 -1.137238  0.987493 -0.502395

[1000 rows x 4 columns]

In [199]:
df[df>3]
df[(df>3).any(axis=1)]

            0         1         2         3
7    0.563359  3.056318 -1.210102  1.877106
49   0.328086  0.329259 -0.431069  3.210039
133  1.424111  0.793858 -0.279870  3.114387
365 -0.545905  0.406415 -0.303715  3.201472
553 -0.519207  0.070902  3.282036  0.720234
725  0.218009  3.378750  0.017224  0.134598
920  0.637277  3.155124  0.127810 -1.208295

In [204]:
#  280보다 큰수가 하나라도 있는 행만 추출하시오.
a = np.random.RandomState(1234)
b = pd.DataFrame(a.randint(1,301, (25,4)))
b
b[(b>280).any(1)]

C:\Users\user\AppData\Local\Temp\ipykernel_12056\439289544.py:5: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  b[(b>280).any(1)]

      0    1    2    3
0   212  295   54  205
3   159  237  283  121
5    77  294  291  196
13   86  175  294  295
16  285    5   83  104
21  260  287  202  276

In [205]:
b[(b>280).any(1)]

C:\Users\user\AppData\Local\Temp\ipykernel_12056\1768319574.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  b[(b>280).any(1)]

      0    1    2    3
0   212  295   54  205
3   159  237  283  121
5    77  294  291  196
13   86  175  294  295
16  285    5   83  104
21  260  287  202  276

##### 6교시

In [206]:
#  0부터 99까지 숫자를 섞어보시오.
np.random.permutation(range(100))

array([78, 75, 76, 94,  7, 56, 97, 96,  0, 49, 25, 30, 89, 98, 29,  6, 50,
       37, 24, 80, 42, 27, 45, 65, 62, 59, 16, 32, 51, 38, 87,  5, 85,  3,
       66, 77, 64, 99, 23, 74, 82, 19, 95, 91, 81, 48, 69, 60, 22, 36, 14,
       20, 86,  2, 10, 72, 61, 33, 53, 47, 40, 15, 83, 13, 54,  9, 58, 31,
       71,  8, 35, 63, 28, 43, 84, 26, 39, 68, 11, 44, 55,  1, 34, 17,  4,
       12, 93, 79, 52, 90, 73, 18, 46, 57, 88, 92, 21, 70, 41, 67])

In [207]:
len(set(np.random.randint(0,101,size = 100)))

69

In [217]:
df.iloc[np.random.permutation(df.index)][:10]

      0    1    2    3
21  297   70  120  160
24  195  205  295   41
2   153   54   90  291
4   257  200   41  129
19  190   83  291  194
16  142  290  278   78
17   24   80  188  172
3   186  233  207    3
20   33  147  298   91
11  241  121  205  132

In [231]:
df.sample(n=10)

      0    1    2    3
1    41  261  292  152
0    76   94  256  138
16  142  290  278   78
23   74  279  109  162
13  124   31  120    2
19  190   83  291  194
4   257  200   41  129
22  293  207  262  153
11  241  121  205  132
5   216   10  212  177

In [232]:
#291p  표시자/더미 변수 계산하기
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)}) 
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [233]:
df['key'].value_counts()

b    3
a    2
c    1
Name: key, dtype: int64

In [234]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [236]:
ti = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
ti['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object